ogneyar/C_Study/MDR_c/MDR32F9Q2I/USART/main.c

#include "main.h"


#include "MDR32FxQI_config.h"
#include "MDR32F9Q2I.h"
#include "MDR32FxQI_uart.h"
#include "MDR32FxQI_port.h"
#include "MDR32FxQI_rst_clk.h"
// #include "MDR32FxQI_eeprom.h"


static PORT_InitTypeDef PortInit;
static UART_InitTypeDef UART_InitStructure;

static uint8_t tmp_data;


int main (void)
{
	RST_CLK_HSEconfig(RST_CLK_HSE_ON);
	while(RST_CLK_HSEstatus() != SUCCESS);

	/* Configures the CPU_PLL clock source */
	RST_CLK_CPU_PLLconfig(RST_CLK_CPU_PLLsrcHSEdiv1, RST_CLK_CPU_PLLmul10);

	/* Enables the CPU_PLL */
	RST_CLK_CPU_PLLcmd(ENABLE);
	if (RST_CLK_CPU_PLLstatus() == ERROR) {
		 while (1);
	}

	// /* Enables the RST_CLK_PCLK_EEPROM */
	// RST_CLK_PCLKcmd(RST_CLK_PCLK_EEPROM, ENABLE);
	// /* Sets the code latency value */
	// EEPROM_SetLatency(EEPROM_Latency_3);

	/* Select the CPU_PLL output as input for CPU_C3_SEL */
	RST_CLK_CPU_PLLuse(ENABLE);
	/* Set CPUClk Prescaler */
	RST_CLK_CPUclkPrescaler(RST_CLK_CPUclkDIV1);

	/* Select the CPU clock source */
	RST_CLK_CPUclkSelection(RST_CLK_CPUclkCPU_C3);

	/* Enables the HSE clock on PORTF */
	RST_CLK_PCLKcmd(RST_CLK_PCLK_PORTF,ENABLE);

	/* Fill PortInit structure*/
	PortInit.PORT_PULL_UP = PORT_PULL_UP_OFF;
	PortInit.PORT_PULL_DOWN = PORT_PULL_DOWN_OFF;
	PortInit.PORT_PD_SHM = PORT_PD_SHM_OFF;
	PortInit.PORT_PD = PORT_PD_DRIVER;
	PortInit.PORT_GFEN = PORT_GFEN_OFF;
	PortInit.PORT_FUNC = PORT_FUNC_OVERRID;
	PortInit.PORT_SPEED = PORT_SPEED_MAXFAST;
	PortInit.PORT_MODE = PORT_MODE_DIGITAL;

	/* Configure PORTF pins 1 (UART2_TX) as output */
	PortInit.PORT_OE = PORT_OE_OUT;
	PortInit.PORT_Pin = PORT_Pin_1;
	PORT_Init(MDR_PORTF, &PortInit);

	/* Configure PORTF pins 0 (UART2_RX) as input */
	PortInit.PORT_OE = PORT_OE_IN;
	PortInit.PORT_Pin = PORT_Pin_0;
	PORT_Init(MDR_PORTF, &PortInit);


	/* Select HSI/2 as CPU_CLK source*/
	RST_CLK_CPU_PLLconfig (RST_CLK_CPU_PLLsrcHSEdiv2,0);

	/* Enables the CPU_CLK clock on UART2 */
	RST_CLK_PCLKcmd(RST_CLK_PCLK_UART2, ENABLE);

	/* Set the HCLK division factor = 1 for UART2*/
	UART_BRGInit(MDR_UART2, UART_HCLKdiv1); //

	/* Initialize UART_InitStructure */
	UART_InitStructure.UART_BaudRate                = 115200;
	UART_InitStructure.UART_WordLength              = UART_WordLength8b;
	UART_InitStructure.UART_StopBits                = UART_StopBits1;
	UART_InitStructure.UART_Parity                  = UART_Parity_No;
	UART_InitStructure.UART_FIFOMode                = UART_FIFO_ON;
	UART_InitStructure.UART_HardwareFlowControl     = UART_HardwareFlowControl_RXE | UART_HardwareFlowControl_TXE;

	/* Configure UART2 parameters*/
	UART_Init (MDR_UART2,&UART_InitStructure);

	/* Enables UART2 peripheral */
	UART_Cmd(MDR_UART2,ENABLE);

	MDR_UART2->DR = (uint32_t)'a';
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);
	UART_SendData(MDR_UART2, '\r');
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);	
	UART_SendData(MDR_UART2, '\n');
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);

	MDR_UART2->DR = (uint32_t)'b';
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);
	UART_SendData(MDR_UART2, '\r');
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);	
	UART_SendData(MDR_UART2, '\n');
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);
	
	MDR_UART2->DR = (uint32_t)'c';
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);
	UART_SendData(MDR_UART2, '\r');
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);	
	UART_SendData(MDR_UART2, '\n');
	while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);

	while (1)
	{
		/* Check TXFE flag */
		while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_RXFE) == SET);

		tmp_data = (uint8_t)UART_ReceiveData(MDR_UART2);

		UART_SendData(MDR_UART2, tmp_data);

		while (UART_GetFlagStatus (MDR_UART2, UART_FLAG_TXFE) != SET);
	}
}

